## Loops and Functions Practice

In this notebook, you'll get some additional practice working with loops and functions for importing, cleaning, and visualizing data.

### Warmup Questions
## Loops

Recall that a loop can be used whenever you are repeating the same operation multiple times.

For example,

In [1]:
print('a')
print('b')
print('c')
print('d')

a
b
c
d

can be rewritten to accomplish the same outcome. We just need to recognize that the repeated code is the `print` function and the part that changes is the argument value.

In [2]:
for n in ['a','b','c','d','f']:
    print(n)#1st loop n = a
    #2nd loop n = b
    #3rd loop n = c
    #4th loop n = d
    #5th loop n = f

a
b
c
d
f

In [3]:
print(n)

f

Recall also that `range` can be helpful when writing for loops if you want to iterate through a set of consecutive numbers.

In [4]:
list(range(10))

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [5]:
print(list(range(0,12,2)))

[0, 2, 4, 6, 8, 10]

In [6]:
for number in range(20):
    print(number)

0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19

**Your Turn:** Write a for loop that prints out the squares of the numbers 1 through 10.

In [7]:
for square in range(1,11):
    #print(square**2)
    print(square, square* square)

1 1
2 4
3 9
4 16
5 25
6 36
7 49
8 64
9 81
10 100

Now, modify your code so that it prints out the squares of the even integers between 1 and 10. 

**Hint:** You can do this either by using conditional logic (if statements) or you might find a different way if you check out the parameters of the range function (https://www.w3schools.com/python/ref_func_range.asp).

In [8]:
for even_squares in range(2, 11, 2):
    print(even_squares**2)

4
16
36
64
100

In [9]:
for n in [4,5,6]:
    print(n)
    if n ==4:
        print(n/2)
    elif n == 5:
        print(n*2)
    elif n == 6:
        print(n-3)
    print('END OF LOOP', '\n\n')

4
2.0
END OF LOOP


5
10
END OF LOOP


6
3
END OF LOOP

### The Accumulator Pattern

Often when working with loops, you will want to capture the results of each iteration. This is usually done by either using a numeric accumulator or a container like a list to hold the intermediate results.

For example, if we wanted to sum the first 100 positive integers we could do this using the accumulator pattern.

In [10]:
total_sum = 0
for number in range(1, 101):
    total_sum += number
    
print(f'The total sum is {total_sum}')

The total sum is 5050

Or, we might want to do a calculation and store the results:

In [11]:
squares = []
for number in range(1, 10):
    squares.append(number**2)

In [12]:
squares

[1, 4, 9, 16, 25, 36, 49, 64, 81]

**Your Turn:** Find the sum of the squares of all even integers between 2 and 1000.

In [13]:
sum_squares = 0
for number in range(2, 1001):
    sum_squares += number **2
print(sum_squares)

333833499

In [14]:
total_sum_even = 0
for number in range(2, 1001):
    total_sum_even += number **2
print(f'The total sum is {total_sum_even}')

The total sum is 333833499

## Functions

When you find yourself repeating the same or very similar code, it could signal that you need a for loop or that you should rewrite your code as a function that can be reused.

Some advantages of using functions are that you don't have to worry about making copy/paste errors and that if you realize that you need to change the logic of your code, you need only update it in one location.

Components of most functions:
* `def` followed by the name of the function
* A set of parentheses and the list of function parameters.
* A body that defines what to do with the inputs.
* A return statement that indicates what the function outputs.

For example, if we want to calculate the square of a number, we could write a very basic function to accomplish this:

In [15]:
def square_number(x):
    return x**2

Once our function is defined, we can call it and pass in inputs:

In [16]:
square_number(10)

100

In [17]:
square_number(-4)

16

Our function can also include more complex logic and multiple return statements:

In [18]:
def absolute_value(x):
    if x >= 0:
        return x
    else:
        return -x

In [19]:
absolute_value(2)

2

In [20]:
absolute_value(-6)

6

**Your Turn:** Write a function named `collatz` that will take as input a number. If that number is even, your function should divide it by two and return the result. If the number is odd, it should triple the number and add one and then return the result.

**Hint:** If you want to check if a number is even, you can use the modulus operator. See, for example, https://discuss.codecademy.com/t/how-can-i-check-if-a-number-is-odd/339354.

In [21]:
def collatz(x):
    if x % 2 == 0:
        return x/2
    else:
        return x*3+1

In [22]:
collatz(2)

1.0

In [23]:
collatz(52)

26.0

In [24]:
collatz(3)

10

In [25]:
collatz(79)

238

### Intermediate Questions

For these questions, you'll be working with data from the Lahman baseball database. In order to get this data into Python, we are going to write a query and execute it using the sqlalchemy library.

In [26]:
import pandas as pd
import matplotlib.pyplot as plt
from sqlalchemy import create_engine, text

In [27]:
import psycopg2

In [28]:
database_name = 'lahman'   # Fill this in with your lahman database name
connection_string = f"postgresql://postgres:postgres@localhost:5432/{database_name}"
engine = create_engine(connection_string)

In [29]:
query = """
SELECT *
FROM teams
"""

teams = pd.read_sql(text(query), con = engine)
teams.head()

,yearid,lgid,teamid,franchid,divid,rank,g,ghome,w,l,...,dp,fp,name,park,attendance,bpf,ppf,teamidbr,teamidlahman45,teamidretro
0,1871,NA,BS1,BNA,None,3,31,NaN,20,10,...,NaN,0.838,Boston Red Stockings,South End Grounds I,NaN,103,98,BOS,BS1,BS1
1,1871,NA,CH1,CNA,None,2,28,NaN,19,9,...,NaN,0.829,Chicago White Stockings,Union Base-Ball Grounds,NaN,104,102,CHI,CH1,CH1
2,1871,NA,CL1,CFC,None,8,29,NaN,10,19,...,NaN,0.814,Cleveland Forest Citys,National Association Grounds,NaN,96,100,CLE,CL1,CL1
3,1871,NA,FW1,KEK,None,7,19,NaN,7,12,...,NaN,0.803,Fort Wayne Kekiongas,Hamilton Field,NaN,101,107,KEK,FW1,FW1
4,1871,NA,NY2,NNA,None,5,33,NaN,16,17,...,NaN,0.839,New York Mutuals,Union Grounds (Brooklyn),NaN,90,88,NYU,NY2,NY2

Now, you're going to write a series of functions to work with this team data. Note that you can write and execute a SQL query using `read_sql` if you want to check that you're getting the correct results. 

Write a function `get_teams` that will take as input a year and which returns the team stats (from the teams table) for the input year.

In [30]:
def get_teams(year):
    query = """
    SELECT *
    FROM teams 
    WHERE yearid = """ + str(year)

    teams = pd.read_sql(text(query), con = engine)
    return teams.head()
    
get_teams(1995)

,yearid,lgid,teamid,franchid,divid,rank,g,ghome,w,l,...,dp,fp,name,park,attendance,bpf,ppf,teamidbr,teamidlahman45,teamidretro
0,1995,AL,BAL,BAL,E,3,144,72,71,73,...,141,0.986,Baltimore Orioles,Oriole Park at Camden Yards,3098475,102,101,BAL,BAL,BAL
1,1995,AL,BOS,BOS,E,1,144,72,86,58,...,151,0.978,Boston Red Sox,Fenway Park II,2164410,103,103,BOS,BOS,BOS
2,1995,AL,CAL,ANA,W,2,145,72,78,67,...,120,0.982,California Angels,Anaheim Stadium,1748680,99,99,CAL,CAL,CAL
3,1995,AL,CHA,CHW,C,3,145,72,68,76,...,131,0.980,Chicago White Sox,Comiskey Park II,1609773,96,95,CHW,CHA,CHA
4,1995,AL,CLE,CLE,C,1,144,72,100,44,...,142,0.982,Cleveland Indians,Jacobs Field,2842745,101,99,CLE,CLE,CLE

Now, write a function `get_best_teams` that will take as input a `year`, a number `n` (which should default to 5) and a parameter `stat` (which should default to wins "w") and which will return the n teams with the largest value for the selected statistic.

Calling `get_best_teams(year = 2014, n = 3)` should return the Los Angeles Angels, the Baltimore Orioles, and the Washington Nationals.

In [31]:
def get_best_teams(year, n=5, stat='w'):
    query = """
    SELECT name, """ + stat + """ 
    FROM teams
    WHERE yearid = """ + str(year) + """
    ORDER BY """ + stat + """ DESC
    LIMIT """ + str(n) 
    
    teams = pd.read_sql(text(query), con = engine)
    return teams

get_best_teams(year = 2014, n = 3)

                            name   w
0  Los Angeles Angels of Anaheim  98
1              Baltimore Orioles  96
2           Washington Nationals  96

Now, modify `get_best_teams` by adding a parameter `ascending` so that you can choose to return either the top or the bottom teams in terms of the selected stat.

Calling `get_best_teams(year=2014, n=3, stat="era", ascending=True)` should return the Washington Nationals, the Seattle Mariners, and the Oakland Athletics.

In [32]:
def get_best_teams(year, n=5, stat='w', ascending=True):
    if ascending==True:
        x='ASC'
    elif ascending==False:
        x='DESC'
    else: 
        return 'wrong'
    query = """
    SELECT name, """ + stat + """ 
    FROM teams
    WHERE yearid = """ + str(year) + """
    ORDER BY """ + stat + """ """ + x + """
    LIMIT """ + str(n) 
    
    teams = pd.read_sql(text(query), con = engine)
    return teams

get_best_teams(year=2014, n=3, stat="era", ascending=True)

                   name   era
0  Washington Nationals  3.03
1      Seattle Mariners  3.17
2     Oakland Athletics  3.22

Now, modify `get_best_teams` so that you can choose to return just the best teams from one league or the other (using the `lgid` column), but by default does not filter based on league. Do this by adding a `league` parameter with default value of "both".

Calling `get_best_teams(year=2014, n=3, league="AL", ascending = True)` should return the Texas Rangers, the Houston Astros, and the Minnesota Twins.

In [33]:
def get_best_teams(year, n=5, stat='w', league='both', ascending=True):
    if ascending==True:
        x='ASC'
    elif ascending==False:
        x='DESC'
    else: 
        return 'wrong'
    
    if league == 'both':
        lgid_filter = ''
    elif league == 'AL':
        lgid_filter = "AND lgid = 'AL'"
    elif league == 'NL':
        lgid_filter = "AND lgid = 'NL'"
    else:
        return 'wrong again'
    query = """
    SELECT name, """ + stat + """ 
    FROM teams
    WHERE yearid = """ + str(year) + """ """ + lgid_filter + """
    ORDER BY """ + stat + """ """ + x + """
    LIMIT """ + str(n) 
    
    teams = pd.read_sql(text(query), con = engine)
    return teams

get_best_teams(year=2014, n=3, league="AL", ascending = True)

              name   w
0    Texas Rangers  67
1   Houston Astros  70
2  Minnesota Twins  70

Now, make a function `plot_best_teams` which takes the same parameters as `get_best_teams` but which creates a bar chart displaying the best teams for the selected stats.

Make sure that your plot has a title and is labeled.

In [72]:
teams.head()

,yearid,lgid,teamid,franchid,divid,rank,g,ghome,w,l,...,dp,fp,name,park,attendance,bpf,ppf,teamidbr,teamidlahman45,teamidretro
0,1871,NA,BS1,BNA,None,3,31,NaN,20,10,...,NaN,0.838,Boston Red Stockings,South End Grounds I,NaN,103,98,BOS,BS1,BS1
1,1871,NA,CH1,CNA,None,2,28,NaN,19,9,...,NaN,0.829,Chicago White Stockings,Union Base-Ball Grounds,NaN,104,102,CHI,CH1,CH1
2,1871,NA,CL1,CFC,None,8,29,NaN,10,19,...,NaN,0.814,Cleveland Forest Citys,National Association Grounds,NaN,96,100,CLE,CL1,CL1
3,1871,NA,FW1,KEK,None,7,19,NaN,7,12,...,NaN,0.803,Fort Wayne Kekiongas,Hamilton Field,NaN,101,107,KEK,FW1,FW1
4,1871,NA,NY2,NNA,None,5,33,NaN,16,17,...,NaN,0.839,New York Mutuals,Union Grounds (Brooklyn),NaN,90,88,NYU,NY2,NY2

In [70]:
def plot_best_teams(year, n=5, stat='w', league='both', ascending=True):
    if ascending==True:
        x='ASC'
    elif ascending==False:
        x='DESC'
    else: 
        return 'wrong'
    
    if league == 'both':
        lgid_filter = ''
    elif league == 'AL':
        lgid_filter = "AND lgid = 'AL'"
    elif league == 'NL':
        lgid_filter = "AND lgid = 'NL'"
    else:
        return 'wrong again'
    query = """
    SELECT name, w AS stat, """ + stat + """ 
    FROM teams
    WHERE yearid = """ + str(year) + """ """ + lgid_filter + """
    ORDER BY """ + stat + """ """ + x + """
    LIMIT """ + str(n) 
    
    teams = pd.read_sql(text(query), con = engine)
    
    plt.bar(x=name, y=stat, data=teams, height=1.0)
    plt.xlabel('Team')
    plt.ylabel('Wins')
    plt.title('Best Teams')

In [71]:
plot_best_teams(year=2014, n=3, league="AL", ascending = True)

NameError: name 'name' is not defined

Add a `filepath` parameter to `plot_best_teams` which defaults to `None`. If a filepath is given, the function should save the resulting plot to the input filepath. **Hint:** You'll need to use the [`savefig` function](https://matplotlib.org/stable/api/_as_gen/matplotlib.pyplot.savefig.html).

In [35]:
# Your Code Here

Finally, utilize a for loop to create an image for each year from 2000 through 2010 which shows the top 10 teams in terms of number of wins. These images should be saved into an `images` folder which appropriate filenames.

In [36]:
# Your Code Here

### Challenge Questions

If you're able to solve the previous questions, you can give these advanced questions a try.

The [Tennessee Department of Health](https://www.tn.gov/health/health-program-areas/statistics/health-data/death-statistics.html) published data on number of deaths by cause broken down by county.

Start with the data contained in `TN Deaths Malignant Neoplasms - 2018.xlsx`.

If you inspect the file, you'll see that the data is divided up into two tables.

First, let's see how we can read in the lefthand table. We can use the `read_excel` function and point it to columns A - G.

In [37]:
neoplasms = pd.read_excel(
    '../data/TN Deaths Malignant Neoplasms - 2018.xlsx',
    header=4,
    usecols='A:G'
)

In [38]:
neoplasms

,COUNTY,NUMBER,RATE,NUMBER.1,RATE.1,NUMBER.2,RATE.2
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,STATE,14139.0,208.8,12058.0,226.9,1973,170.7
2,ANDERSON,187.0,244.5,179.0,255.3,8,*
3,BEDFORD,111.0,226.3,99.0,232.0,10,*
4,BENTON,71.0,438.7,69.0,449.9,2,*
5,BLEDSOE,30.0,203.2,29.0,216.9,1,*
6,BLOUNT,305.0,232.2,297.0,241.0,7,*
7,BRADLEY,227.0,212.7,221.0,227.8,5,89.9
8,CAMPBELL,107.0,270.3,105.0,272.2,2,*
9,CANNON,47.0,324.7,45.0,325.0,2,*
10,CARROLL,96.0,342.6,93.0,382.7,3,*
11,CARTER,143.0,253.8,141.0,259.7,2,*
12,CHEATHAM,83.0,205.2,78.0,202.5,2,*
13,CHESTER,33.0,191.0,31.0,205.6,1,*
14,CLAIBORNE,84.0,264.6,84.0,274.5,-,-
15,CLAY,17.0,219.9,17.0,228.5,-,-
16,COCKE,89.0,248.7,88.0,258.9,-,-
17,COFFEE,131.0,235.2,128.0,248.8,2,*
18,CROCKETT,42.0,293.3,35.0,296.3,7,*
19,CUMBERLAND,183.0,306.6,183.0,316.4,-,-
20,DAVIDSON,1078.0,155.6,763.0,168.7,295,153.9
21,DECATUR,34.0,290.4,34.0,306.5,-,-
22,DEKALB,48.0,238.4,47.0,246.0,1,*
23,DICKSON,138.0,258.2,128.0,258.2,9,*
24,DYER,84.0,225.1,76.0,246.3,7,131.1
25,FAYETTE,86.0,212.3,59.0,207.4,27,241
26,FENTRESS,55.0,302.0,55.0,308.9,-,-
27,FRANKLIN,93.0,222.0,90.0,235.0,3,*
28,GIBSON,129.0,263.0,102.0,261.3,27,304.9
29,GILES,64.0,216.9,57.0,223.5,7,*
30,GRAINGER,69.0,298.2,69.0,307.0,-,-
31,GREENE,192.0,277.9,188.0,284.9,4,*
32,GRUNDY,37.0,277.7,37.0,285.5,-,-
33,HAMBLEN,130.0,201.3,125.0,211.9,5,*
34,HAMILTON,725.0,199.0,580.0,209.7,137,193.5
35,HANCOCK,19.0,290.9,19.0,298.1,-,-
36,HARDEMAN,68.0,269.6,48.0,344.1,19,178.5
37,HARDIN,73.0,283.2,70.0,289.1,3,*
38,HAWKINS,147.0,260.1,142.0,260.6,4,*
39,HAYWOOD,56.0,323.0,28.0,341.7,28,318.1
40,HENDERSON,71.0,255.0,64.0,257.1,7,*
41,HENRY,106.0,327.5,95.0,327.7,10,*
42,HICKMAN,68.0,271.5,68.0,293.5,-,-
43,HOUSTON,30.0,362.8,30.0,386.2,-,-
44,HUMPHREYS,62.0,335.2,59.0,338.3,2,*
45,JACKSON,44.0,374.3,44.0,385.6,-,-
46,JEFFERSON,123.0,227.8,117.0,227.0,6,*
47,JOHNSON,70.0,393.8,70.0,410.8,-,-
48,KNOX,889.0,191.1,797.0,199.1,84,202.5
49,NaN,NaN,NaN,NaN,NaN,NaN,NaN
50,TOTAL MAY INCLUDE EVENTS WITH RACE OTHER THA...,NaN,NaN,NaN,NaN,NaN,NaN
51,* RATE IS NOT DISPLAYED ACCORDING TO THE ...,NaN,NaN,NaN,NaN,NaN,NaN
52,.. COUNT IS NOT DISPLAYED ACCORDING TO THE T...,NaN,NaN,NaN,NaN,NaN,NaN

Do the following steps to clean up the resulting dataframe:
* Remove the unneeded rows at the top and bottom
* Give the columns descriptive names
* Ensure that the numeric columns are numeric (and have NaNs where there were either *'s or -'s). **Hint:** You could use the pandas `to_numeric` function for this.

Once you have these steps figured out, create a function named `get_deaths_data` that takes as input a `filepath` and string of `usecols` and returns the resulting cleaned up dataframe.

In [39]:
# Your Code Here

Now, apply your function to both tables contained in the `TN Deaths Malignant Neoplasms - 2018.xlsx` sheet and concatenate the results together to get a single resulting dataframe.

In [40]:
# Your Code Here

We can get a list of all of the filenames contained in the data folder using the `glob` library:

In [41]:
import glob
filenames = glob.glob('../data/*.xlsx')

filenames

['../data\\TN Deaths Accidental Causes - 2018.xlsx',
 '../data\\TN Deaths Cerebrovascular Disease - 2018.xlsx',
 '../data\\TN Deaths Diabetes - 2018.xlsx',
 '../data\\TN Deaths Diseases of Heart - 2018.xlsx',
 '../data\\TN Deaths Malignant Neoplasms - 2018.xlsx']

Your final task is to create a dataframe which has one row per county and one column per cause of death. This column should have the total number of deaths for that cause.

In [42]:
# Your Code Here